In [15]:
from pandas import Series,DataFrame
import numpy as np

In [17]:
frame = pd.DataFrame(np.arange(12).reshape((4,3)),index=[list('aabb'),[1,2,1,2]],columns=[['Ohio','Ohio','Colorado'],['Green','Red','Green']])

In [19]:
frame

     Ohio     Colorado
    Green Red    Green
a 1     0   1        2
  2     3   4        5
b 1     6   7        8
  2     9  10       11

In [21]:
frame.index.names=['key1','key2']

In [23]:
frame

           Ohio     Colorado
          Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

In [26]:
frame.columns.names=['state','color']

In [27]:
frame

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

In [30]:
frame['Ohio']

color      Green  Red
key1 key2
a    1         0    1
     2         3    4
b    1         6    7
     2         9   10

In [32]:
frame.swaplevel('key1','key2')

state      Ohio     Colorado
color     Green Red    Green
key2 key1
1    a        0   1        2
2    a        3   4        5
1    b        6   7        8
2    b        9  10       11

In [37]:
frame

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

In [35]:
frame.sortlevel(1)

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
b    1        6   7        8
a    2        3   4        5
b    2        9  10       11

In [41]:
frame.swaplevel(0,1).sortlevel(0)

state      Ohio     Colorado
color     Green Red    Green
key2 key1
1    a        0   1        2
     b        6   7        8
2    a        3   4        5
     b        9  10       11

In [44]:
frame.sum(level='key1')

state  Ohio     Colorado
color Green Red    Green
key1
a         3   5        7
b        15  17       19

In [47]:
frame.sum(level='color',axis=1)

color      Green  Red
key1 key2
a    1         2    1
     2         8    4
b    1        14    7
     2        20   10

In [51]:
frame = DataFrame({'a':range(7),'b':range(7,0,-1),
                   'c':['one','one','one','two','two','two','two'],
                   'd':[0,1,2,0,1,2,3]})

In [52]:
frame

   a  b    c  d
0  0  7  one  0
1  1  6  one  1
2  2  5  one  2
3  3  4  two  0
4  4  3  two  1
5  5  2  two  2
6  6  1  two  3

In [62]:
frame2 = frame.set_index(['c','d'])

In [63]:
frame2.swaplevel('c','d').sortlevel(0)

       a  b
d c
0 one  0  7
  two  3  4
1 one  1  6
  two  4  3
2 one  2  5
  two  5  2
3 two  6  1

In [64]:
frame2.reset_index()#setidnex()时，drop不能为false

     c  d  a  b
0  one  0  0  7
1  one  1  1  6
2  one  2  2  5
3  two  0  3  4
4  two  1  4  3
5  two  2  5  2
6  two  3  6  1

In [66]:
ser = Series(np.arange(3.))

In [69]:
ser[-1:]

2    2.0
dtype: float64

In [71]:
ser2 = Series(np.arange(3),index=list('abc'))

In [73]:
ser2[-1]

2

In [74]:
ser.ix[:1]

0    0.0
1    1.0
dtype: float64

In [81]:
ser3 = Series(range(3),index=[-5,1,10])
ser3

-5     0
 1     1
 10    2
dtype: int32

In [83]:
ser3.iget_value(2)# 严格基于位置的索引，而不依赖于标注的索引

d:\Anaconda3\lib\site-packages\ipykernel\__main__.py:1: FutureWarning: iget_value(i) is deprecated. Please use .iloc[i] or .iat[i]
  if __name__ == '__main__':

2

In [85]:
frame = DataFrame(np.arange(6.).reshape(3,2),index=[2,0,1])

In [86]:
frame.irow(0)

d:\Anaconda3\lib\site-packages\ipykernel\__main__.py:1: FutureWarning: irow(i) is deprecated. Please use .iloc[i]
  if __name__ == '__main__':

0    0.0
1    1.0
Name: 2, dtype: float64

In [88]:
df = pd.read_csv('E:/X/python/ch06/ex1.csv')

In [89]:
df

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [90]:
pd.read_table('E:/X/python/ch06/ex1.csv',sep=',')

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [93]:
pd.read_csv('E:/X/python/ch06/ex2.csv',header=None)

   0   1   2   3      4
0  1   2   3   4  hello
1  5   6   7   8  world
2  9  10  11  12    foo

In [94]:
pd.read_csv('E:/X/python/ch06/ex2.csv',names=['a','b','c','d','message'])

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [96]:
names = ['a','b','c','d','message']

In [97]:
pd.read_csv('E:/X/python/ch06/ex2.csv',names=names,index_col='d')

    a   b   c message
d
4   1   2   3   hello
8   5   6   7   world
12  9  10  11     foo

In [99]:
parsed=pd.read_csv('E:/X/python/ch06/csv_mindex.csv',index_col=['key1','key2'])

In [105]:
parsed

           value1  value2
key1 key2
one  a          1       2
     b          3       4
     c          5       6
     d          7       8
two  a          9      10
     b         11      12
     c         13      14
     d         15      16

In [122]:
parsed.swaplevel(0,1).sortlevel(1)

           value1  value2
key2 key1
a    one        1       2
b    one        3       4
c    one        5       6
d    one        7       8
a    two        9      10
b    two       11      12
c    two       13      14
d    two       15      16

In [143]:
result = pd.read_table('E:/X/python/ch06/ex3.txt',sep='\s+')

In [144]:
result

            A         B         C
aaa -0.264438 -1.026059 -0.619500
bbb  0.927272  0.302904 -0.032399
ccc -0.264273 -0.386314 -0.217601
ddd -0.871858 -0.348382  1.100491

In [145]:
pd.read_csv('E:/X/python/ch06/ex4.csv',skiprows=[0,2,3])

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [149]:
result=pd.read_csv('E:/X/python/ch06/ex5.csv')

In [150]:
result

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [151]:
pd.isnull(result)

  something      a      b      c      d message
0     False  False  False  False  False    True
1     False  False  False   True  False   False
2     False  False  False  False  False   False

In [152]:
result=pd.read_csv('E:/X/python/ch06/ex5.csv',na_values=['NULL'])

In [153]:
result

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [154]:
sentinels = {'message':['foo','Na'],'something':['two']}

In [155]:
pd.read_csv('E:/X/python/ch06/ex5.csv',na_values=sentinels)

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       NaN  5   6   NaN   8   world
2     three  9  10  11.0  12     NaN

In [158]:
result = pd.read_csv('E:/X/python/ch06/ex6.csv',nrows=5)

In [159]:
result

        one       two     three      four key
0  0.467976 -0.038649 -0.295344 -1.824726   L
1 -0.358893  1.404453  0.704965 -0.200638   B
2 -0.501840  0.659254 -0.421691 -0.057688   G
3  0.204886  1.074134  1.388361 -0.982404   R
4  0.354628 -0.133116  0.283763 -0.837063   Q

In [191]:
chunker = pd.read_csv('E:/X/python/ch06/ex6.csv',chunksize=1000)

In [192]:
chunker

In [193]:
tot = Series([])

In [194]:
for piece in chunker:
    tot = tot.add(piece['key'].value_counts(),fill_value=0)

In [197]:
tot=tot.order(ascending=False)

d:\Anaconda3\lib\site-packages\ipykernel\__main__.py:1: FutureWarning: order is deprecated, use sort_values(...)
  if __name__ == '__main__':

In [198]:
tot[:10]

E    368.0
X    364.0
L    346.0
O    343.0
Q    340.0
M    338.0
J    337.0
F    335.0
K    334.0
H    330.0
dtype: float64

In [199]:
data = pd.read_csv('E:/X/python/ch06/ex5.csv')

In [200]:
data

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [201]:
data.to_csv('E:/X/python/ch06/TTTT.csv')

In [203]:
import sys

In [205]:
data.to_csv(sys.stdout,sep='|')

|something|a|b|c|d|message
0|one|1|2|3.0|4|
1|two|5|6||8|world
2|three|9|10|11.0|12|foo

In [209]:
data.to_csv(sys.stdout,sep='=',na_rep='NULL')

=something=a=b=c=d=message
0=one=1=2=3.0=4=NULL
1=two=5=6=NULL=8=world
2=three=9=10=11.0=12=foo

In [212]:
data.to_csv(sys.stdout,index=False,cols=['a','b','c'])

something,a,b,c,d,message
one,1,2,3.0,4,
two,5,6,,8,world
three,9,10,11.0,12,foo

In [217]:
dates = pd.date_range('1/1/2000',periods=7)

In [218]:
dates

DatetimeIndex(['2000-01-01', '2000-01-02', '2000-01-03', '2000-01-04',
               '2000-01-05', '2000-01-06', '2000-01-07'],
              dtype='datetime64[ns]', freq='D')

In [219]:
ts = Series(np.arange(7),index=dates)

In [220]:
ts

2000-01-01    0
2000-01-02    1
2000-01-03    2
2000-01-04    3
2000-01-05    4
2000-01-06    5
2000-01-07    6
Freq: D, dtype: int32

In [221]:
Series.from_csv('E:/X/python/ch06/tseries.csv',parse_dates=True)

2000-01-01    0
2000-01-02    1
2000-01-03    2
2000-01-04    3
2000-01-05    4
2000-01-06    5
2000-01-07    6
dtype: int64

In [230]:
import csv

In [231]:
f = open('E:/X/python/ch06/ex7.csv')
f

In [232]:
reader = csv.reader(f)

In [233]:
list(reader)

[['a', 'b', 'c'], ['1', '2', '3'], ['1', '2', '3', '4']]

In [238]:
for line in reader:
    print(line)

In [239]:
lines = list(csv.reader(open('E:/X/python/ch06/ex7.csv')))

In [241]:
header,values = lines[0],lines[1:]

In [244]:
data_dict={h: v for h,v in zip(header,zip(*values))}

In [245]:
data_dict

{'a': ('1', '1'), 'b': ('2', '2'), 'c': ('3', '3')}

In [247]:
values

[['1', '2', '3'], ['1', '2', '3', '4']]

In [248]:
class my_dialect(csv.Dialect):
    lineterminator='\n'
    delimiter=';'
    quotechar = '"'

reader = csv.reader(f,diaect=my_dialect)

TypeError: 'diaect' is an invalid keyword argument for this function

In [257]:
from lxml.html import parse
from urllib.request import urlopen

In [262]:
paesed = parse(urlopen('http://n2cx.yundasys.com:18090/wsd/kjcx/cxend.jsp?wen=3924321154593'))

In [265]:
paesed